#
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

# cli tools
brew 'git'
brew 'wget'
brew 'yarn'
brew 'make'
brew 'mysql', restart_service: true
brew 'awscli'
brew 'serverless'
brew 'telnet'

# php gubbins
brew 'php'

# gui apps
cask 'google-chrome'
cask 'visual-studio-code'
cask 'sublime-text'
cask '1password'
cask 'postman'
cask 'dropbox'
cask 'backblaze'
cask 'microsoft-teams'
cask 'daisydisk'
cask 'fantastical'
cask 'microsoft-remote-desktop'

# fun stuff
cask 'handbrake'
cask 'spotify'
cask 'discord'
cask 'steam'
cask 'whatsapp'

# vscode plugins
vscode "be5invis.toml"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "jmsv.javascriptsnippetsstandard"
vscode "johnpapa.vscode-peacock"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-vscode.vscode-typescript-next"
vscode "sirtori.indenticator"
vscode "standard.vscode-standard"
vscode "waderyan.gitblame"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"