#
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask-drivers'

# cli tools
brew 'git'
brew 'wget'
brew 'yarn'
brew 'make'
brew 'mysql'
brew 'awscli'
brew 'serverless'
brew 'telnet'
brew 'docker'
brew 'docker-machine'

# gui apps
cask 'google-chrome'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'docker'
cask '1password'
cask 'postman'
cask 'dropbox'
cask 'backblaze'
cask 'microsoft-teams'
cask 'fantastical'
cask 'microsoft-remote-desktop'

# fun stuff
cask 'handbrake'
cask 'spotify'
cask 'discord'
cask 'steam'
cask 'whatsapp'
