# 
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask-drivers'

# cli tools
brew 'wget'
brew 'yarn'
brew 'make'
brew 'mysql'
brew 'awscli'
brew 'serverless'
brew 'telnet'

# gui apps
cask 'google-chrome'
cask 'visual-studio-code'
cask '1password6'
cask 'screenflow'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'vagrant'
cask 'docker'
cask '1password'
cask 'postman'
cask 'dropbox'
cask 'notational-velocity'
cask 'backblaze'
cask 'handbrake'

# fun stuff
cask 'spotify'
cask 'epic-games'
cask 'sonos'

# App store
# mas 'Tweetbot', id: 1384080005
